{
    "welcome": ["Welcome to SpyGraph! Select your language: &nbsp;<button class=\"btn btn-primary\" style=\"background-color: white;\" onclick=\"fill_text(0)\">&#x1F1FA;&#x1F1F8;</button><button class=\"btn btn-danger\" style=\"background-color: white;\" onclick=\"fill_text(1)\">&#x1F1EA;&#x1F1F8;</button>", "Bienvenido a SpyGraph! Seleccione su idioma: &nbsp;<button class=\"btn btn-primary\" style=\"background-color: white;\" onclick=\"fill_text(0)\">&#x1F1FA;&#x1F1F8;</button><button class=\"btn btn-danger\" style=\"background-color: white;\" onclick=\"fill_text(1)\">&#x1F1EA;&#x1F1F8;</button>"],
    "artist1": ["Artist 1", "Artista 1"],
    "artist2": ["Artist 2", "Artista 2"],
    "artists_button": ["Check connection","Consultar conexion"],
    "new_song": ["New song", "Nueva cancion"],
    "song_button": ["Upload song" , "Agregar cancion"],
    "new_playlist": ["New album or playlist","Nuevo album o playlist"],
    "playlist_button": ["Upload playlist", "Agregar playlist"],
    "what": ["What is SpyGraph?", "Que es SpyGraph?"],
    "what_explanation": ["Imagine you are in Mick Jagger's house (yes, the best day of your life). Plus, you have a magic portal that can transport you from one house to the other instantly and as many times as you want, but with the condition that the house you are arriving must be the one of an artist that colaborated with Mick in a song. In general, the portal can take you from one house to another as long as the two owners of the houses are two artists that colaborated together in a song. Could you go from Mick's house to, for instance, Shakira's? In how many trips? And what about Madonna? Well, SpyGraph is a platform that helps us to resolve these questions.", "Imaginate que estas en la casa de Mick Jagger (el mejor dia de tu vida). Ademas, tenes un portal magico que te puede llevar de una casa a otra al instante y todas las veces que quieras, pero con la condicion de que solo podes ir a casas de artistas que hayan colaborado con Mick. Mejor aun, el portal te puede llevar desde la casa de cualquier artista a la casa de cualquier otro artista siempre y cuando esos dos artistas hayan colaborado en una cancion. Podrias llegar a la casa de, por ejemplo, Shakira? En cuantos viajes? Y a la de Madonna? SpyGraph es una plataforma que nos ayuda a resolver estas inquietudes."],
    "can": ["What can I do?", "Que puedo hacer?"],
    "can_explanation": ["On this site, you can do 3 actions:<br>1) Ask for two artists: With this, you are asking if we could go from \"Artist 1\"'s house to \"Artist 2\"'s. In case we can't, the response will be negative. In case it is possible, the response will be the minimum path (that is, going through as few houses as we can) and the list of songs that make the trip possible.<br><strong>Disclaimer:</strong> The app works with its own database, so a negative response doesn't mean that there's no possible path, it just means that it couldn't find one with the songs in the base right now. To mitigate this, you can do one of the following two actions.<br>2) Upload a song: If there's a song that you believe is a good connection-maker or that isn't in the database, you can add it.<br>3) Upload an album or a playlist: If you want to upload all the songs of a certain list, you can do this instad of uploading them one by one.", "En esta pagina podes hacer 3 cosas: <br>1) Consultar por dos artistas: Con esto, estas preguntando si es posible ir desde la casa del \"Artista 1\" a la del \"Artista 2\". En caso de que no se pueda, la respuesta sera negativa. En caso de que si, la respuesta sera el menor camino de una casa a la otra (o sea, pasando por la menor cantidad de casas posible) junto con las canciones que hacen el viaje posible.<br><strong>Nota:</strong> La aplicacion funciona con una base de datos propia que no contiene todas las canciones, entonces que la respuesta sea negativa no quiere decir que no haya un camino, sino que no lo hay con las canciones que hay en la base de datos actualmente. Para mitigar esto, podes hacer alguna de las otras dos acciones.<br>2) Cargar una cancion: Si hay alguna cancion que crees que aporta buenas conecciones entre casas, o que no sabes si ya esta en la base, podes agregarla.<br>3) Cargar un album o playlist: Si queres cargar todas las canciones de una lista, en vez de cargarlas una por una podes directamente cargar toda la lista."],
    "how": ["How does it work?", "Como funciona?"],
    "how_explanation": ["You have to comunicate by the Spotify app, which can be opened by clicking <a style=\"color: darkcyan;\" href=\"https://open.spotify.com/\" target=\"_blank\">here</a>. For instance, if you want to upload the song \"Get Lucky\" to connect Pharrell Williams and Daft Punk, you have to search it in the Spotify app, click on <em>share</em>, copy the link of the song, paste it in the \"New song\" box and click on \"Upload song\".<br><br><img src=\"images/Get_Lucky.png\" height=\"53.25%\" width=\"75%\" class=\"center\"><br><br>Similarly, to upload an album or playlist, you have to copy the link of the list and paste it in the \"New album or playlist\" box, and to ask for a connection, you have to put the links of the two artists you want to ask in the respective boxes.<br><br><img src=\"images/Mick_Jagger.png\" height=\"33.45%\" width=\"75%\" class=\"center\"><br>For example, Mick Jagger's share link is <span style=\"color:darkcyan\">https://open.spotify.com/artist/3d2pb1dHTm8b61zAGVUVvO?si=b7641f65ef68410e</span>, and Shakira's is <span style=\"color:darkcyan\">https://open.spotify.com/artist/0EmeFodog0BfCgMzAIvKQp?si=WXkC6d2qRxWm8nqefdB6ig</span>, so to ask if these two are connected, you can paste these two links in \"Artist 1\" and \"Artist 2\" and click in the \"Check connection\" button.","Debes comunicarte por el reproductor de Spotify, el cual podes abrir clickeando <a style=\"color: darkcyan;\" href=\"https://open.spotify.com/\" target=\"_blank\">aqui</a>. Por ejemplo, si queres subir la cancion \"Get Lucky\" para conectar a Daft Punk y Pharrell Williams, tenes que buscar esa cancion en Spotify, clickear en <em>compartir</em>, copiar el link de la cancion, pegarlo en la casilla \"Cargar nueva cancion\" y clickear en \"Agregar nueva cancion\".<br><br><img src=\"images/Get_Lucky.png\" height=\"53.25%\" width=\"75%\" class=\"center\"><br><br>De la misma forma, para cargar un album o playlist, tenes que copiar el link de la lista y pegarlo en \"Cargar nuevo album o playlist\", y para consultar una conexion, tenes que poner los links de los dos artistas que queres consultar en las respectivas casillas.<br><br><img src=\"images/Mick_Jagger.png\" height=\"33.45%\" width=\"75%\" class=\"center\"><br>Por ejemplo, el link de Mick Jagger es <span style=\"color:darkcyan\">https://open.spotify.com/artist/3d2pb1dHTm8b61zAGVUVvO?si=b7641f65ef68410e</span>, y el de Shakira es <span style=\"color:darkcyan\">https://open.spotify.com/artist/0EmeFodog0BfCgMzAIvKQp?si=WXkC6d2qRxWm8nqefdB6ig</span>, entonces para preguntar si ellos estan conectados, podes pegar estos links en \"Artista 1\" y \"Artista 2\" y clickear en el boton \"Consultar conexion\"."],
    "developed": ["Developed by:", "Desarrollado por:"],
    "invalid_song": ["Invalid song :(<br>Make sure to read the instructions carefully and introduce the link properly.", "Cancion invalida :(<br>Asegurate de leer las instrucciones con cuidado y de introducir el link correctamente."],
    "invalid_playlist": ["Invalid playlist :(<br>Make sure to read the instructions carefully and introduce the link properly.", "Playlist invalida :(<br>Asegurate de leer las instrucciones con cuidado y de introducir el link correctamente."],
    "invalid_artist1": ["Invalid artist 1 :(<br>Make sure to read the instructions carefully and introduce the link properly.", "Artista 1 invalido :(<br>Asegurate de leer las instrucciones con cuidado y de introducir el link correctamente."],
    "invalid_artist2": ["Invalid artist 2 :(<br>Make sure to read the instructions carefully and introduce the link properly.", "Artista 2 invalido :(<br>Asegurate de leer las instrucciones con cuidado y de introducir el link correctamente."],
    "something_wrong": ["Something went wrong, please try again later :(", "Algo salio mal, por favor intentalo de nuevo mas tarde :("],
    "succesful_song": ["Song uploaded!", "Cancion subida correctamente!"],
    "succesful_playlist": ["Playlist uploaded!", "Playlist subida correctamente!"],
    "same_artist": ["They are connected since they are the same artist.", "Estan conectados ya que son el mismo artista."],
    "not_connected": ["These artists are not connected for now :( <br>But you can upload more songs or playlists and see if you can connect them!", "Estos artistas no estan conectados por ahora :( <br>Pero podes subir mas canciones o playlists para ver si los podes conectar!"],
    "connected": ["We found a path!<br>","Encontramos un camino!<br>"],
    "give_path": [
        ["connects to", "by"],
        ["se conecta a", "por"]
    ]
}